let list = [
  ['사계', '상상중중중상중상'],
  ['알루미늄', '상상상중상상상상'],
  ['신호등', '중중중중중중중중'],
  ['너난나넌', '하중하하중하중하'],
  ['무이이야', '중중중중중중중상'],
  ['컴플', '하하하하중중하하'],
  ['헤픈우연', '하하하하하하하하'],
  ['운전면허', '중상중상중중중중'],
  ['안녕', '하중중중하중하중'],
  ['내일이오면', '상상중중중상상하'],
  ['에잇', '하하중중중중중중'],
  ['비밀의화원', '중하중중하중중중'],
  ['홍연', '하하하중하하하하'],
  ['지켜줄게', '중하하하중중중중'],
  ['메컵', '상상상상중상상중'],
  ['인연', '중중하중하하중하'],
  ['시작', '하하하하하하중중'],
  ['너만을느끼며', '상상상상상상상상'],
  ['사랑할수록', '하하하하하중하중'],
  ['배데빗', '하중하중중하중하'],
  ['자작곡', '중중중중중중중중'],
]

list = list.map(c => {
  let arr = c[1].split('');
  let score = 0;
  arr.forEach(x => {
    switch (x) {
      case '상':
        score += 3;
        break;
      case '중':
        score += 2;
        break;
      case '하':
        score += 1;
        break;
    }
  })
  return [c[0], score / 8]
})

list.sort((a, b) => {
  return b[1] - a[1];
})

console.log(list);
