let songs = [
  ['사계', ['이강희', '김보균', '김재훈', '김채웅', '김지원', '정재화'], 7],
  ['알루미늄', ['박준호', '김재훈', '김채웅', '남지우', '이미르', '정재화'], 9],
  ['신호등', ['이강희', '김재훈', '문수빈', '김채웅', '김지원', '정재화'], 7],
  ['너에게 난 나에게 넌', ['이강희', '박지한', '문수빈', '김재훈', '김채웅', '김지원', '이선주'], 7],
  ['무이이야', ['박지한', '김재훈', '김채웅', '박세영', '정재화'], 7],
  ['complicated', ['전  민', '김보균', '김재훈', '문수빈', '남지우', '박세영', '이선주'], 8],
  ['헤픈 우연', ['박준호', '김주원', '김재훈', '문수빈', '남지우', '이선주', '박세영'], 7],
  ['drivers lisence', ['전  민', '문수빈', '김지원', '김보균', '김채웅'], 8],
  ['안녕', ['권수현', '김병조', '이지호', '김민지', '여지우', '강희준', '이시연'], 7],
  ['내일이 오면', ['이재준', '박시현', '이지호', '김병조', '홍지우', '오상희', '김수아'], 8],
  ['에잇', ['이재준', '박시현', '이시연', '강재호', '전시찬', '홍지우', '김병조', '김민지'], 6],
  ['비밀의 화원', ['김주원', '김민지', '강재호', '전시찬', '여지우', '이시연'], 7],
  ['홍연', ['김수현', '강재호', '전시찬', '정재화', '김민지', '이시연'], 8],
  ['지켜줄게', ['김민지', '김주원', '김병조', '강재호', '전시찬', '여지우', '강희준'], 7],
  ['make up', ['박시현', '강재호', '이지호', '전시찬', '오상희', '김수아', '강희준'], 7],
  ['인연', ['이시연', '김민지', '이지호', '강재호', '전시찬', '김병조', '김수아'], 8],
  ['시작', ['김선우', '박시현', '이지호', '김병조', '홍지우', '오상희', '강희준'], 7],
  ['너만을 느끼며', ['박준호', '김선우', '이지호', '김재훈', '남지우', '이선주', '김수아'], 7],
  ['사랑할수록', ['정재환', '박준호', '김채웅', '김지원', '이미르', '조민영'], 8],
  ['bad habits', ['정재환', '문수빈', '남지우', '박세영', '조민영'], 7],
  ['lunatic', ['정재환', '박세영', '이선주', '김채웅'], 7],
  ['love ballad', ['박시현', '이미르', '박지한', '이시연', '김수아', '강재호', '전시찬', '정재화', '김지원'], 11],
  ['about time', ['박시현', '강재호', '김수아', '이미르', '전시찬', '정재화'], 7],
  ['예비역', ['김병조', '이강희', '김민지', '이미르', '김민규'], 20]
]
let time = [
  []
]
let notAbleTime = [
  ['권수현', []],
  ['김보균', []],
  ['박세영', []],
  ['김병조', []],
  ['여지우', []],
  ['이재준', []],
  ['강희준', []]
]
//================================================== 전체 멤버 배열화
let members = [];
songs.forEach(c => {
  members = [...members, ...c[1], 0];  // 0은 본인 곡 텀 -> 가장 많은 사람 기준 63분
})

members = [...new Set(members)];
//console.log(members)
//================================================== 멤버당 할당 곡 수 및 목록 배열화
let membersSongCnt = [];

members.forEach(member => {
  let cnt = 0;
  let list = [];
  songs.forEach(song => {
    if (song[1].indexOf(member) !== -1) {
      list.push(song[0])
      cnt++;
    }
  })
  membersSongCnt.push([member, cnt, list.join(',')]);
})

// membersSongCnt = membersSongCnt.map(c => { //================== 멤버별 곡 수 런타임 합
//   let sum = 0;
//   c[2].split(',').forEach(x => {
//     songs.forEach(song => {
//       if (song[0] === x) {
//         sum += song[2]
//         return;
//       }
//     })
//   })
//   return [c[0], c[1], sum];
// })
// console.log(membersSongCnt.sort((a, b) => a[2] - b[2]))
// membersSongCnt.forEach(c => {
//   console.log(c[0] + ':' + c[1] + ':' + c[2]);
// })
//==================================================
//songs.forEach(c => {
//   console.log(c[0] + ':' + c[1])
// })
//==================================================
let practiceTime = 0;

while (songs.length != 1) {
  // 몬해먹겠네
}
